eisup_2019_docmng_integration/src/Documents/ВыбытиеОсновныхСредствМеждународный/ВыбытиеОсновныхСредствМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыбытиеОсновныхСредствМеждународный</name>
  <comment>(Упр)</comment>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСМеждународный</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>МестонахождениеОбъекта</name>
      <comment>Подразделение организации, в котором находится объект ОС</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>МестонахождениеОбъектаНов</name>
      <comment>Подразделение организации, в котором находится объект ОС</comment>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛНов</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.абс_ЧастичнаяЛиквидацияОС</types>
        <types>DocumentRef.СписаниеОС</types>
        <types>DocumentRef.ПередачаОС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет/ПараметрыАмортизацииОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыАмортизацииОСБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокИспользованияДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрименитьВТекущемМесяце</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <comment>(Упр)</comment>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаписи</name>
    <comment>Дата формирования проводки регламентной процедурой</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРегламентнойОперации</name>
    <type>
      <types>EnumRef.ВидыРегламентныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПродукции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийСписанияОС/абс_ВидыОперацийСписанияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийСписанияОС</name>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеМеждуФилиалами</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ВыбытиеОсновныхСредствМеждународный/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходимое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
			
			ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
			
			Если ТабДокумент = Неопределено Тогда
				Возврат
			КонецЕсли; 
			
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		
	КонецПроцедуры // Печать
	
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()


Процедура ОбработкаПроведения(Отказ)
	//
	//Если мУдалятьДвижения Тогда
	//	ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	//КонецЕсли;
	
	//Для Каждого ТекСтрокаОсновныеСредства Из ОсновныеСредства Цикл
	//	СрезСведенийМежд = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.ПолучитьПоследнее(Дата, Новый Структура("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство));
	
	//	// регистр ОсновныеСредстваМеждународныйУчет 
	//	ДвижениеРС = Движения.ОсновныеСредстваМеждународныйУчет.Добавить();
	//	ДвижениеРС.Период = Дата;
	//	ДвижениеРС.ОсновноеСредство = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//	ДвижениеРС.Организация = Организация;
	//	ДвижениеРС.ДатаПринятияКУчету = СрезСведенийМежд.ДатаПринятияКУчету;
	//	ДвижениеРС.МестонахождениеОбъекта = ТекСтрокаОсновныеСредства.МестонахождениеОбъектаНов;
	//	ДвижениеРС.МОЛ = ТекСтрокаОсновныеСредства.МОЛНов;
	//	ДвижениеРС.СчетУчета = СрезСведенийМежд.СчетУчета;
	//	ДвижениеРС.СрокПолезногоИспользования = СрезСведенийМежд.СрокПолезногоИспользования;
	//	ДвижениеРС.МетодНачисленияАмортизации = СрезСведенийМежд.МетодНачисленияАмортизации;
	//	ДвижениеРС.СчетНачисленияАмортизации = СрезСведенийМежд.СчетНачисленияАмортизации;
	//	ДвижениеРС.ПервоначальнаяСтоимость = СрезСведенийМежд.ПервоначальнаяСтоимость;
	//	ДвижениеРС.ЛиквидационнаяСтоимость = СрезСведенийМежд.ЛиквидационнаяСтоимость;
	//	ДвижениеРС.СчетЗатрат = СрезСведенийМежд.СчетЗатрат;
	//	ДвижениеРС.Субконто1 = СрезСведенийМежд.Субконто1;
	//	ДвижениеРС.Субконто2 = СрезСведенийМежд.Субконто2;
	//	ДвижениеРС.Субконто3 = СрезСведенийМежд.Субконто3;
	//	ДвижениеРС.ПредполагаемыйОбъемПродукции = СрезСведенийМежд.ПредполагаемыйОбъемПродукции;
	//	ДвижениеРС.СуммаНачисленнойАмортизации = СрезСведенийМежд.СуммаНачисленнойАмортизации;
	//	ДвижениеРС.СправедливаяСтоимость = СрезСведенийМежд.СправедливаяСтоимость;
	//	ДвижениеРС.НачислятьАмортизацию = Ложь;
	//	ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета; // д.б. НаходитсяВСтадииВыбытия;
	//	ДвижениеРС.СчетСниженияСтоимости = СрезСведенийМежд.СчетСниженияСтоимости;
	//	
	//	// Проверка "хвостов" по "СчетУчета" и "СчетНачисленияАмортизации"
	//	МассивСчетов = Новый Массив();
	//	МассивСчетов.Добавить(СрезСведенийМежд.СчетУчета);
	//	МассивСчетов.Добавить(СрезСведенийМежд.СчетНачисленияАмортизации);
	//	МассивСчетов.Добавить(СрезСведенийМежд.СчетСниженияСтоимости);
	//	
	//	БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
	//	БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
	//	СуммаДт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", СрезСведенийМежд.СчетУчета, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//	СуммаКт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетНачисленияАмортизации, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//	СуммаКт1 = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетСниженияСтоимости, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//	
	//	Если СуммаДт <> 0 Тогда
	//		Движение = Движения.Международный.Добавить();
	//		Движение.Период = Дата;
	//		Движение.СчетДт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
	//		Движение.СчетКт = СрезСведенийМежд.СчетУчета;
	//		Движение.Организация = Организация;
	//		Движение.Сумма = СуммаДт;
	//		Движение.Содержание = "Закрытие счета учета основного средства";
	//		Движение.НомерЖурнала = "Рег";
	//		
	//		Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//		Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если СуммаКт <> 0 Тогда
	//		Движение = Движения.Международный.Добавить();
	//		Движение.Период = Дата;
	//		Движение.СчетДт = СрезСведенийМежд.СчетНачисленияАмортизации;
	//		Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
	//		Движение.Организация = Организация;
	//		Движение.Сумма = СуммаКт;
	//		Движение.Содержание = "Закрытие счета начисления амортизации основного средства";
	//		Движение.НомерЖурнала = "Рег";
	//		
	//		Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//		Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	Если СуммаКт1 <> 0 Тогда
	//		Движение = Движения.Международный.Добавить();
	//		Движение.Период = Дата;
	//		Движение.СчетДт = СрезСведенийМежд.СчетСниженияСтоимости;
	//		Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
	//		Движение.Организация = Организация;
	//		Движение.Сумма = СуммаКт1;
	//		Движение.Содержание = "Закрытие счета снижения стоимости основного средства";
	//		Движение.НомерЖурнала = "Рег";
	//		
	//		Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//		Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//	ОбщаяСуммаКорректировки = СуммаДт - СуммаКт - СуммаКт1;
	//	
	//	// Проверяем если вместе с подготовкой к выбытию было и само выбытие
	//	СчетаОС = Новый Массив();
	//	СчетаОС.Добавить(ПланыСчетов.Международный.ОсновныеСредства); //101
	//	СчетаОС.Добавить(ПланыСчетов.Международный.ИнвестиционнаяСобственностьНетто); //102
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ
	//				   |	МеждународныйОбороты.Субконто1 КАК ОС,
	//				   |	СУММА(МеждународныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
	//				   |	МеждународныйОбороты.КорСчет
	//				   |ИЗ
	//				   |	РегистрБухгалтерии.Международный.Обороты(&НачалоПериода, &КонецПериода, Период, Счет В ИЕРАРХИИ (&Счет), &ОС, Организация = &Организация, НЕ(КорСчет В ИЕРАРХИИ (&СчетаОС)), ) КАК МеждународныйОбороты
	//				   |
	//				   |ГДЕ
	//				   |	МеждународныйОбороты.Субконто1 = &ОсновноеСредство
	//				   |
	//				   |СГРУППИРОВАТЬ ПО
	//				   |	МеждународныйОбороты.Субконто1,
	//				   |	МеждународныйОбороты.КорСчет";
	//	
	//	Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
	//	Запрос.УстановитьПараметр("КонецПериода", ПериодКонец);
	//	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи);
	//	Запрос.УстановитьПараметр("ОС", ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
	//	Запрос.УстановитьПараметр("Организация", Организация);
	//	Запрос.УстановитьПараметр("СчетаОС", СчетаОС);
	//	Запрос.УстановитьПараметр("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство);
	
	//	Результат = Запрос.Выполнить();
	//	Выборка = Результат.Выбрать();
	//	
	//	Если Выборка.Следующий() Тогда // Если были операции, связанные с выбытием.
	//		ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета;
	//		
	//		БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
	//		БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
	//		СуммаДт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ТекСтрокаОсновныеСредства.ОсновноеСредство) - БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.ОсновныеСредстваДляПродажи, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//		Если (СуммаДт + ОбщаяСуммаКорректировки) <> 0 Тогда // Если есть остаток по 201 с учетом предыдущей корретировки, то списываем его
	//			Движение = Движения.Международный.Добавить();
	//			Движение.Период = Дата;
	//			Движение.СчетДт = Выборка.КорСчет;
	//			Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
	//			Движение.Организация = Организация;
	//			Движение.Сумма = СуммаДт + ОбщаяСуммаКорректировки;
	//			Движение.Содержание = "Выбытие основного средства";
	//			Движение.НомерЖурнала = "Рег";
	//			
	//			Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//			КонецЕсли;
	//			
	//			Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//			КонецЕсли;
	//			
	//			// Списываем резерв переоценки
	//			БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
	//			БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
	//			СуммаСписания = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//			Если СуммаСписания <> 0 Тогда
	//				Движение = Движения.Международный.Добавить();
	//				Движение.Период = Дата;
	//				Движение.СчетДт = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС; //30271
	//				Движение.СчетКт = ПланыСчетов.Международный.НераспределеннаяПрибыль; //304
	//				Движение.Организация = Организация;
	//				Движение.Сумма = СуммаСписания;
	//				Движение.Содержание = "Списание резерва";
	//				Движение.НомерЖурнала = "Рег";
	//				
	//				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//	
	//	// Проверяем, был ли резерв переоценки по данному ОС
	//	БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
	//	БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
	//	СуммаКт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство) - БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС, ТекСтрокаОсновныеСредства.ОсновноеСредство);
	//	
	//	Если СуммаКт <> 0 Тогда
	//		Движение = Движения.Международный.Добавить();
	//		Движение.Период = Дата;
	//		Движение.СчетДт = ПланыСчетов.Международный.РезервыНаПереоценкуОСиИС;
	//		Движение.СчетКт = ПланыСчетов.Международный.НераспределеннаяПрибыль;
	//		Движение.Организация = Организация;
	//		Движение.Сумма = СуммаКт;
	//		Движение.Содержание = "Закрытие резерва переоценки основного средства";
	//		Движение.НомерЖурнала = "Рег";
	//		
	//		Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//		
	//		Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
	//			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// записываем движения регистров
	//Движения.ОсновныеСредстваМеждународныйУчет.Записать();
	//Движения.Международный.Записать();
	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	//АБС
	Таб = Новый таблицаЗначений;
	Таб = ПолучитьСуммуПоСчетам();
	
	//\\АБС
	
	//АБС ИЗМЕНЕНИЕ  71572
	ОстаточнаяСтоимостьНаНачалоПЕриодаБУ=ПолучитьОстаточнуюСтоимостьБУ();
	ТабОстМСФО = ПолучитьОстаткиМСФО();
	//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
	
	Для Каждого ТекСтрокаОсновныеСредства Из ОсновныеСредства Цикл
		СрезСведенийМежд = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.ПолучитьПоследнее(Дата, Новый Структура("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство));
		//АБС
		СрезСведений = РегистрыСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.ПолучитьПоследнее(Дата, Новый Структура("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство));
		СуммаСписания01 = ПолучитьСумму(ПланыСчетов.Хозрасчетный.ОСвОрганизации,Таб,ТекСтрокаОсновныеСредства.ОсновноеСредство);
		СуммаСписания02 =ПолучитьСумму(ПланыСчетов.Хозрасчетный.АмортизацияОС_01,Таб,ТекСтрокаОсновныеСредства.ОсновноеСредство);
		СуммаСписания0109=ПолучитьСумму(ПланыСчетов.Хозрасчетный.ВыбытиеОС,Таб,ТекСтрокаОсновныеСредства.ОсновноеСредство);
		
		//АБС
		
		//АБС ИЗМЕНЕНИЕ  71572
		МассивСчетов = Новый Массив();
		МассивСчетов.Добавить(СрезСведенийМежд.СчетУчета);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетНачисленияАмортизации);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетСниженияСтоимости);
		//24.08.11
		//БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		//БухИтоги.РассчитатьИтоги("Международный", "НачальныйОстатокДт,НачальныйОстатокКт", "Сумма", "Счет,Субконто1", НачалоМесяца(ПериодНачало), НачалоМесяца(ПериодНачало), , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
		////СуммаДт = БухИтоги.ПолучитьИтог("СуммаНачальныйОстатокДт", "Счет,Субконто1", СрезСведенийМежд.СчетУчета, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//СуммаКт = БухИтоги.ПолучитьИтог("СуммаНачальныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетНачисленияАмортизации, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//СуммаКт1 = БухИтоги.ПолучитьИтог("СуммаНачальныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетСниженияСтоимости, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		СуммаМСФОНачОстаток = ТабОстМСФО.Найти(ТекСтрокаОсновныеСредства.ОсновноеСредство,"ОС");
		Если СуммаМСФОНачОстаток<>Неопределено Тогда
			СуммаДт =СуммаМСФОНачОстаток.Сумма01Нач;
			СуммаКт =СуммаМСФОНачОстаток.Сумма02Нач; 
			СуммаКт1 =  0;
		КонецЕсли;
		
		//24.08.11
		//Счет Дт - это Остаточная стоимость по счету учета МСФО на нач месяца
		//Счет Кт - это Остаточная амортизация (накопленная) по счету учета МСФО на нач месяца
		//СуммаКт1 - ? какая-то стоимость по счету МСФО
		//Коэффициент01  = (Ост. стоимость МСФО*СуммыВыбытия БУ)/Остаточная стоимостьБУ
		//Коэффициент02 = (Ост. стоимость МСФО по амортизации*СуммыВыбытия БУ амортизации)/Остаточная стоимостьБУ амортизации
		//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
		
		// регистр ОсновныеСредстваМеждународныйУчет 
		ДвижениеРС = Движения.ОсновныеСредстваМеждународныйУчет.Добавить();
		ДвижениеРС.Период = Дата;
		ДвижениеРС.ОсновноеСредство = ТекСтрокаОсновныеСредства.ОсновноеСредство;
		ДвижениеРС.Организация = Организация;
		ДвижениеРС.ДатаПринятияКУчету = СрезСведенийМежд.ДатаПринятияКУчету;
		ДвижениеРС.МестонахождениеОбъекта = ТекСтрокаОсновныеСредства.МестонахождениеОбъектаНов;
		ДвижениеРС.МОЛ = ТекСтрокаОсновныеСредства.МОЛНов;
		ДвижениеРС.СчетУчета = СрезСведенийМежд.СчетУчета;
		ДвижениеРС.СрокПолезногоИспользования = СрезСведенийМежд.СрокПолезногоИспользования;
		ДвижениеРС.МетодНачисленияАмортизации = СрезСведенийМежд.МетодНачисленияАмортизации;
		ДвижениеРС.СчетНачисленияАмортизации = СрезСведенийМежд.СчетНачисленияАмортизации;
		//АБС
		//ДвижениеРС.ПервоначальнаяСтоимость = СрезСведенийМежд.ПервоначальнаяСтоимость;
		Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
			ДвижениеРС.ПервоначальнаяСтоимость = СрезСведенийМежд.ПервоначальнаяСтоимость;
		Иначе 
			//АБС ИЗМЕНЕНИЕ 71572
			Сумма01Остаток=ОстаточнаяСтоимостьНаНачалоПЕриодаБУ.Найти(ДвижениеРС.ОсновноеСредство,"ОС");
			СуммаСписания =?(Сумма01Остаток<>Неопределено,(СуммаДт*СуммаСписания01)/Сумма01Остаток.Сумма01,0);
			
			//Коэффициент = СрезСведенийМежд.ПервоначальнаяСтоимость/СрезСведений.СтоимостьДляВычисленияАмортизации;
			//АБС ВСТАВКА 70974
			//Коэффициент = ?(СрезСведений.СтоимостьДляВычисленияАмортизации=0,1,СрезСведенийМежд.ПервоначальнаяСтоимость/СрезСведений.СтоимостьДляВычисленияАмортизации);
			//\\АБС ВСТАВКА 70974 КОНЕЦ
			//АБС ИЗМЕНЕНИЕ 71105
			//СуммаСписания = ?(СуммаСписания01=Неопределено,0,СуммаСписания01*Коэффициент); 
			//\\АБС ИЗМЕНЕНИЕ 71105 КОНЕЦ
			//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
			ДвижениеРС.ПервоначальнаяСтоимость = СрезСведенийМежд.ПервоначальнаяСтоимость-СуммаСписания;
		КонецЕсли;
		//АБС
		ДвижениеРС.ЛиквидационнаяСтоимость = СрезСведенийМежд.ЛиквидационнаяСтоимость;
		ДвижениеРС.СчетЗатрат = СрезСведенийМежд.СчетЗатрат;
		ДвижениеРС.Субконто1 = СрезСведенийМежд.Субконто1;
		ДвижениеРС.Субконто2 = СрезСведенийМежд.Субконто2;
		ДвижениеРС.Субконто3 = СрезСведенийМежд.Субконто3;
		ДвижениеРС.ПредполагаемыйОбъемПродукции = СрезСведенийМежд.ПредполагаемыйОбъемПродукции;
		ДвижениеРС.СуммаНачисленнойАмортизации = СрезСведенийМежд.СуммаНачисленнойАмортизации;
		ДвижениеРС.СправедливаяСтоимость = СрезСведенийМежд.СправедливаяСтоимость;
		//АБС
		//ДвижениеРС.НачислятьАмортизацию = Ложь;
		//ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета; // д.б. НаходитсяВСтадииВыбытия;
		Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
			ДвижениеРС.НачислятьАмортизацию = Ложь;
			ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета; 
		Иначе 
			ДвижениеРС.НачислятьАмортизацию = Истина;
			ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.ВведеноВЭксплуатацию; 
		КонецЕсли;
		
		//\\АБС
		ДвижениеРС.СчетСниженияСтоимости = СрезСведенийМежд.СчетСниженияСтоимости;
		
		// Проверка "хвостов" по "СчетУчета" и "СчетНачисленияАмортизации"
		МассивСчетов = Новый Массив();
		МассивСчетов.Добавить(СрезСведенийМежд.СчетУчета);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетНачисленияАмортизации);
		МассивСчетов.Добавить(СрезСведенийМежд.СчетСниженияСтоимости);
		
		//АБС ИЗМЕНЕНИЕ 71572
		Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
			
			//БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
			//БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , МассивСчетов, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
			//СуммаДт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", СрезСведенийМежд.СчетУчета, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			//СуммаКт = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетНачисленияАмортизации, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			//СуммаКт1 = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", СрезСведенийМежд.СчетСниженияСтоимости, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			Если СуммаМСФОНачОстаток<>Неопределено Тогда
				СуммаДт =СуммаМСФОНачОстаток.Сумма01Кон;
				СуммаКт =СуммаМСФОНачОстаток.Сумма02Кон; 
				СуммаКт1 =  0;
			КонецЕсли;
			
			
		КонецЕсли;
		//\\АБС ИЗМЕНЕНИЕ 71572
		
		//АБС
		МассивСчетовБУ = Новый Массив();
		МассивСчетовБУ.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
		//АБС ВСТАВКА 70974
		Сумма01=0;
		Сумма02=0;
		//\\АБС ВСТАВКА КОНЕЦ 70974
		
		//БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
		//БухИтоги.РассчитатьИтоги("Хозрасчетный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Новый Граница(КонецМесяца(ЭтотОбъект.ПериодКонец),ВидГраницы.Включая), Новый Граница(КонецМесяца(ЭтотОбъект.ПериодКонец),ВидГраницы.Включая), , МассивСчетовБУ, ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства, , ,"Организация", Организация);
		//Сумма02БУ = БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Хозрасчетный.АмортизацияОС_01, ТекСтрокаОсновныеСредства.ОсновноеСредство);
		//АБС
		
		Если СуммаДт <> 0 Тогда
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			//АБС ИЗМЕНЕНИЕ 71141
			
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если ТекСтрокаОсновныеСредства.Документ.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
					Движение.СчетДт = ПланыСчетов.Международный.РасчетыВыделенномуИмущ; 	
				Иначе
					Движение.СчетДт = ПланыСчетов.Международный.ВыбытиеОС; 	
				КонецЕсли;
				
			Иначе	
				Движение.СчетДт = ПланыСчетов.Международный.ВыбытиеОС;
			КонецЕсли;
			
			
			//\\АБС ИЗМЕНЕНИЕ 71141 КОНЕЦ
			//Движение.СчетДт = ПланыСчетов.Международный.Служебный; //201
			Движение.СчетКт = СрезСведенийМежд.СчетУчета;
			Движение.Организация = Организация;
			//АБС
			//Движение.Сумма = СуммаДт;
			Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС")Тогда
				Сумма01 = СуммаДт;
				Движение.Сумма = СуммаДт;
			Иначе
				//АБС ИЗМЕНЕНИЕ 71572
				Сумма01Остаток=ОстаточнаяСтоимостьНаНачалоПЕриодаБУ.Найти(ДвижениеРС.ОсновноеСредство,"ОС");
				СуммаСписания =?(Сумма01Остаток<>Неопределено,(СуммаДт*СуммаСписания01)/Сумма01Остаток.Сумма01,0);
				Движение.Сумма =СуммаСписания;
				Сумма01=СуммаСписания;
				//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
				////АБС ИЗМЕНЕНИЕ 71105
				//Движение.Сумма = ?(СуммаСписания01=Неопределено,0,СуммаСписания01*Коэффициент);
				//Сумма01 = ?(СуммаСписания01=Неопределено,0,СуммаСписания01*Коэффициент);
				////\\АБС ИЗМЕНЕНИЕ 71105 КОНЕЦ
			КонецЕсли;
			//АБС
			Движение.Содержание = "Закрытие счета учета основного средства";
			Движение.НомерЖурнала = "Рег";
			
			Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			
			Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
			КонецЕсли
			
			
		КонецЕсли;
		
		Если СуммаКт <> 0 Тогда
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = СрезСведенийМежд.СчетНачисленияАмортизации;
			//АБС ИЗМЕНЕНИЕ 71141
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если ТекСтрокаОсновныеСредства.Документ.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
					Движение.СчетКт = ПланыСчетов.Международный.РасчетыВыделенномуИмущ; 	
				Иначе
					Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС; //201	
				КонецЕсли;
				
			Иначе	
				Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС; //201
			КонецЕсли;

			//\\АБС ИЗМЕНЕНИЕ 71141 КОНЕЦ
			//Движение.СчетКт = ПланыСчетов.Международный.Служебный; //201
			Движение.Организация = Организация;
			//АБС
			//Движение.Сумма = СуммаКт;
			Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
				Движение.Сумма = СуммаКт;
				Сумма02 = СуммаКт; 
			Иначе
				//Движение.Сумма = СуммаСписания02*СуммаКт/Сумма02БУ;
				//Сумма02 = СуммаСписания02*СуммаКт/Сумма02БУ; 
				//Коэфф = СуммаСписания/СрезСведенийМежд.ПервоначальнаяСтоимость;
				//АБС ВСТАВКА 70974
				//Коэфф = ?(СрезСведенийМежд.ПервоначальнаяСтоимость=0,1,СуммаСписания/СрезСведенийМежд.ПервоначальнаяСтоимость);
				////АБС ВСТАВКА 70974 КОНЕЦ
				//Движение.Сумма = СуммаКт*Коэфф;
				//Сумма02 = СуммаКт*Коэфф; 
				//АБС ИЗМЕНЕНИЕ 71572
				Сумма02Остаток=ОстаточнаяСтоимостьНаНачалоПЕриодаБУ.Найти(ДвижениеРС.ОсновноеСредство,"ОС");
				СуммаСписания =?(Сумма02Остаток<>Неопределено,(СуммаКт*СуммаСписания02)/Сумма02Остаток.Сумма02,0);
				Движение.Сумма =СуммаСписания;
				Сумма02=СуммаСписания;
				//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
				
			КонецЕсли;
			
			//АБС
			Движение.Содержание = "Закрытие счета начисления амортизации основного средства";
			Движение.НомерЖурнала = "Рег";
			
			Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			
			Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
			КонецЕсли

			//АБС
		Иначе
			Сумма02 = 0;
			//АБС
		КонецЕсли;
		
		Если СуммаКт1 <> 0 Тогда
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			//АБС ИЗМЕНЕНИЕ 71141
			Движение.СчетДт = СрезСведенийМежд.СчетСниженияСтоимости;
			//\\АБС ИЗМЕНЕНИЕ 71141 КОНЕЦ
			//Движение.СчетКт = СрезСведенийМежд.Служебный;
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если ТекСтрокаОсновныеСредства.Документ.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
					Движение.СчетКт = ПланыСчетов.Международный.РасчетыВыделенномуИмущ; 	
				Иначе
					Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС; //201	
				КонецЕсли;
				
			Иначе	
				Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС; //201
			КонецЕсли;
			Движение.Организация = Организация;
			Движение.Сумма = СуммаКт1;
			Движение.Содержание = "Закрытие счета снижения стоимости основного средства";
			Движение.НомерЖурнала = "Рег";
			
			Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			
			Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
			КонецЕсли;
			Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
				
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОбособленныеПодразделения] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
				КонецЕсли;
			КонецЕсли
			
		КонецЕсли;
		
		ОбщаяСуммаКорректировки = СуммаДт - СуммаКт - СуммаКт1;
		//АБС
		Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
			ОбщаяСуммаКорректировки = (Окр(Сумма01,2) - Окр(Сумма02,2));	
		Иначе
			ОбщаяСуммаКорректировки = Окр(СуммаДт,2) - Окр(СуммаКт,2);// - СуммаКт1;
		КонецЕсли;
		
		Если  ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
				Если ТекСтрокаОсновныеСредства.Документ.ВидОперации=Перечисления.абс_ВидыОперацийСписанияОС.ПеремещениеМеждуФилиалами Тогда
			ОбщаяСуммаКорректировки =0;		
				КонецЕсли;
         КонецЕсли;

				
		//АБС
		
		// Проверяем если вместе с подготовкой к выбытию было и само выбытие
		СчетаОС = Новый Массив();
		СчетаОС.Добавить(ПланыСчетов.Международный.ОсновныеСредства); //101
		
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = "ВЫБРАТЬ
		//			   |	МеждународныйОбороты.Субконто1 КАК ОС,
		//			   |	СУММА(МеждународныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
		//			   |	МеждународныйОбороты.КорСчет
		//			   |ИЗ
		//			   |	РегистрБухгалтерии.Международный.Обороты(&НачалоПериода, &КонецПериода, Период, Счет В ИЕРАРХИИ (&Счет), &ОС, Организация = &Организация, НЕ(КорСчет В ИЕРАРХИИ (&СчетаОС)), ) КАК МеждународныйОбороты
		//			   |
		//			   |ГДЕ
		//			   |	МеждународныйОбороты.Субконто1 = &ОсновноеСредство
		//			   |
		//			   |СГРУППИРОВАТЬ ПО
		//			   |	МеждународныйОбороты.Субконто1,
		//			   |	МеждународныйОбороты.КорСчет";
		//
		//Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
		//Запрос.УстановитьПараметр("КонецПериода", ПериодКонец);
		//Запрос.УстановитьПараметр("Счет", ПланыСчетов.Международный.ВыбытиеОС);
		//Запрос.УстановитьПараметр("ОС", ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
		//Запрос.УстановитьПараметр("Организация", Организация);
		//Запрос.УстановитьПараметр("СчетаОС", СчетаОС);
		//Запрос.УстановитьПараметр("ОсновноеСредство", ТекСтрокаОсновныеСредства.ОсновноеСредство);
		
		//Результат = Запрос.Выполнить();
		//Выборка = Результат.Выбрать();
		
		//Если Выборка.Следующий() ИЛИ ОбщаяСуммаКорректировки <> 0  Тогда // Если были операции, связанные с выбытием.
		
		Если ОбщаяСуммаКорректировки <> 0  Тогда // Если были операции, связанные с выбытием.
			Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) <> Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС") Тогда
				ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.СнятоСУчета;
			Иначе
				ДвижениеРС.Состояние = Перечисления.ВидыСостоянийОС.ВведеноВЭксплуатацию;
			КонецЕсли;
			
			//БухИтоги = Обработки.БухгалтерскиеИтоги.Создать();
			//БухИтоги.РассчитатьИтоги("Международный", "КонечныйОстатокДт,КонечныйОстатокКт", "Сумма", "Счет,Субконто1", Дата, Дата, , ПланыСчетов.Международный.ОСвОрганизации, ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства, , ,"Организация", Организация);
			СуммаДт = 0;//БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокДт", "Счет,Субконто1", ПланыСчетов.Международный.ВыбытиеОС, ТекСтрокаОсновныеСредства.ОсновноеСредство) - БухИтоги.ПолучитьИтог("СуммаКонечныйОстатокКт", "Счет,Субконто1", ПланыСчетов.Международный.ВыбытиеОС, ТекСтрокаОсновныеСредства.ОсновноеСредство);
			Если (СуммаДт + ОбщаяСуммаКорректировки) <> 0 Тогда // Если есть остаток по 201 с учетом предыдущей корретировки, то списываем его
				Движение = Движения.Международный.Добавить();
				Движение.Период = Дата;
				Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС")
					ИЛИ ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
					Структура =  МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ТекСтрокаОсновныеСредства.Документ.СчетСписанияБУ);
					Движение.СчетДт =Структура.Счет;
					
				ИначеЕсли ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.ПередачаОС")	 Тогда
					Структура =  МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ТекСтрокаОсновныеСредства.Документ.ОС[0].СчетРасходовБУ);
					Движение.СчетДт =Структура.Счет;
					
				КонецЕсли;
				//Движение.СчетКт = ПланыСчетов.Международный.ОсновныеСредстваДляПродажи; //201
				//АБС
				Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС;//ОсновныеСредстваДляПродажи; //201
				
				Движение.Организация = Организация;
				Движение.Сумма = СуммаДт + ОбщаяСуммаКорректировки;
				Движение.Содержание = "Выбытие основного средства";
				Движение.НомерЖурнала = "Рег";
				Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.абс_ЧастичнаяЛиквидацияОС")
					ИЛИ ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.СписаниеОС") Тогда
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = ТекСтрокаОсновныеСредства.Документ.СубконтоБУ;
					КонецЕсли;
					
				Иначе
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
					КонецЕсли;
				КонецЕсли;
				Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства,) = Неопределено Тогда
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства] = ТекСтрокаОсновныеСредства.ОсновноеСредство;
				КонецЕсли;
				Если ТипЗнч(ТекСтрокаОсновныеСредства.Документ) = Тип("ДокументСсылка.ПередачаОС") Тогда
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = ТекСтрокаОсновныеСредства.Документ.ОС[0].СубконтоБУ;
					КонецЕсли;
					
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = ТекСтрокаОсновныеСредства.Документ.ОС[0].СубконтоБУ;
					КонецЕсли;
				КонецЕсли;
				
				
				
			КонецЕсли;
		КонецЕсли;
		
		//
		
		
	КонецЦикла;
	
	КопияТЗ = ОсновныеСредства.Выгрузить();
	КопияТЗ.Свернуть("Документ");
	Для Каждого ТекСтрокаОсновныеСредства Из КопияТЗ Цикл
		//Перенос остальных проводок, не относящихся в 01 и 02 счетам
		НаборПроводокБУ = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		НаборПроводокБУ.Отбор.Регистратор.Установить(ТекСтрокаОсновныеСредства.Документ);
		НаборПроводокБУ.Прочитать();
		Для Каждого ЗаписьБУ Из НаборПроводокБУ Цикл
			Если Не ЗаписьБУ.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОсновныеСредства) И
				Не  ЗаписьБУ.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств) И
				Не ЗаписьБУ.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОсновныеСредства) И
				Не  ЗаписьБУ.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств)  Тогда
				
				СтруктураДт = МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ЗаписьБУ.СчетДт);
				СтруктураКт = МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ЗаписьБУ.СчетКт);
				Если ЗначениеЗаполнено(СтруктураДт.Счет) И ЗначениеЗаполнено(СтруктураКт.Счет) Тогда
					Движение = Движения.Международный.Добавить();
					Движение.Период = Дата;
					Движение.СчетДт = СтруктураДт.Счет;
					Движение.СчетКт = СтруктураКт.Счет;
					Движение.Организация =  Организация;
					Движение.Сумма = ЗаписьБУ.Сумма;
					Движение.Содержание = ЗаписьБУ.Содержание;
					Движение.НомерЖурнала = "Рег";
					//Контрагенты
					
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Контрагенты,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Контрагенты] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Контрагенты,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Контрагенты] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты];
					КонецЕсли;
					//Контрагенты
					
					//Договоры
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Договоры,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Договоры] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Договоры,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.Договоры] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры];
					КонецЕсли;	   
					//Договоры
					
					//Номенклатурные группы
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.НоменклатурныеГруппы] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы];
					КонецЕсли;	   
					//Номенклатурные группы
					
					//Прочие доходы и расходы
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ПрочиеДоходыИРасходы] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ПрочиеДоходыИРасходы];
					КонецЕсли;	   
					//Прочие доходы и расходы
					//ВидыПлатежейВБюджетИФонды
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыПлатежейВГосБюджет,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыПлатежейВГосБюджет] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыПлатежейВГосБюджет,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ВидыПлатежейВГосБюджет] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ВидыПлатежейВГосБюджет];
					КонецЕсли;	   
					//ВидыПлатежейВБюджетИФонды
					
					
					//СтавкиНДС
					Если не Движение.СчетДт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтавкиНДС,) = Неопределено Тогда
						Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтавкиНДС] = ЗаписьБУ.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС];
					КонецЕсли;
					Если не Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтавкиНДС,) = Неопределено Тогда
						Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтавкиНДС] = ЗаписьБУ.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтавкиНДС];
					КонецЕсли;	   
					//ВидыПлатежейВБюджетИФонды
				Иначе
					Сообщить("Дт "+ЗаписьБУ.СчетДт+" Кт"+ ЗаписьБУ.СчетКт);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		
	КонецЦикла;
	
	//АБС ВСТАВКА 36048  11.03.2014 17:10:43  Глебов
	ЗаполнитьСтоимостьОСМеждународный();
	//АБС ВСТАВКА 36048 КОНЕЦ	
	
	// записываем движения регистров
	Движения.ОсновныеСредстваМеждународныйУчет.Записать();
	Движения.Международный.Записать();
	
КонецПроцедуры

//АБС
Функция ПолучитьСуммуПоСчетам() 
	МассивДт = Новый Массив;
	МассивДт.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
	МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД);
	
	МассивКт = Новый Массив;
	МассивКт.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	МассивКт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 КАК ОС,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОборотыДтКт.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	|				ТОГДА ХозрасчетныйОборотыДтКт.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма01,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОборотыДтКт.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОС_01)
	|				ТОГДА ХозрасчетныйОборотыДтКт.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма02,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОборотыДтКт.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ВыбытиеОС)
	|					И ХозрасчетныйОборотыДтКт.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОС_01)
	|				ТОГДА ХозрасчетныйОборотыДтКт.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма0109
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачПериода, &КонПериода, Регистратор, СчетДт В (&СчетаДт), , СчетКт В (&СчетаКт), , ) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	(ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.СписаниеОС
	|			ИЛИ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.ПередачаОС
	//АБС ИЗМЕНЕНИЕ 71141
	|			ИЛИ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.абс_ЧастичнаяЛиквидацияОС)
	//\\АБС ИЗМЕНЕНИЕ 71141 КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1";
	Запрос.УстановитьПараметр("НачПериода",ЭтотОбъект.ПериодНачало);
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ЭтотОбъект.ПериодКонец));
	Запрос.УстановитьПараметр("СчетаДт",МассивДт);
	Запрос.УстановитьПараметр("СчетаКт",МассивКт);
	
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСумму(Счет,Таб,ОсновноеСредство)
	СтруктураОтбора = Новый Структура("ОС", ОсновноеСредство);
	МассивСтрок = Таб.НайтиСтроки(СтруктураОтбора);
	Для Каждого стр Из МассивСтрок Цикл
		Если Счет =ПланыСчетов.Хозрасчетный.ОСвОрганизации Тогда
			Если ЗначениеЗаполнено(стр.Сумма01) Тогда
				Возврат стр.Сумма01;
			КонецЕсли;	
		ИначеЕсли Счет =ПланыСчетов.Хозрасчетный.АмортизацияОС_01 Тогда
			Если ЗначениеЗаполнено(стр.Сумма02) Тогда
				Возврат стр.Сумма02;
			КонецЕсли;	
			
		ИначеЕсли  Счет =ПланыСчетов.Хозрасчетный.ВыбытиеОС Тогда
			Если ЗначениеЗаполнено(стр.Сумма0109) Тогда
				Возврат стр.Сумма0109;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;
	
	//АБС ИЗМЕНЕНИЕ 71105
	Если МассивСтрок.Количество()=0 Тогда
		возврат 0;
	КонецЕсли;
	//\\АБС ИЗМЕНЕНИЕ 71105 КОНЕЦ
	
КонецФункции

Функция ПолучитьОстаточнуюСтоимостьБУ()
	//АБС ИЗМЕНЕНИЕ  71572
	МассивДт = Новый Массив;
	МассивДт.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОС_01);
	//МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	//МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД);
	
	// МассивКт = Новый Массив;
	МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	//МассивКт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	ХозрасчетныйОстатки.Субконто1 КАК ОС,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	|				ТОГДА ХозрасчетныйОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма01,
	|	СУММА(ВЫБОР
	|			КОГДА ХозрасчетныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АмортизацияОС_01)
	|				ТОГДА -ХозрасчетныйОстатки.СуммаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма02
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(&КонПЕриода, Счет В (&МассивСчетов), &ОсновныеСредства, Организация = &Организация) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Субконто1";
	Запрос.УстановитьПараметр("ОсновныеСредства",ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
	Запрос.УстановитьПараметр("КонПериода",ЭтотОбъект.ПериодНачало);
	Запрос.УстановитьПараметр("МассивСчетов",МассивДт);
	Запрос.УстановитьПараметр("Организация",Организация);
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
КонецФункции

Функция ПолучитьОстаткиМСФО()
	//АБС ИЗМЕНЕНИЕ  71572
	МассивДт = Новый Массив;
	МассивДт.Добавить(ПланыСчетов.Международный.ОСвОрганизации);
	//МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	//МассивДт.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасходыНеОблагаемыеЕНВД);
	
	// МассивКт = Новый Массив;
	МассивДт.Добавить(ПланыСчетов.Международный.АмортизацияОС_01);
	//МассивКт.Добавить(ПланыСчетов.Хозрасчетный.ВыбытиеОС);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	МеждународныйОстатки.Субконто1 КАК ОС,
	              |	СУММА(ВЫБОР
	              |			КОГДА МеждународныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Международный.ОСвОрганизации)
	              |				ТОГДА МеждународныйОстатки.СуммаОстаток
	              |			ИНАЧЕ 0
	              |		КОНЕЦ) КАК Сумма01Кон,
	              |	СУММА(ВЫБОР
	              |			КОГДА МеждународныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Международный.АмортизацияОС_01)
	              |				ТОГДА -МеждународныйОстатки.СуммаОстаток
	              |			ИНАЧЕ 0
	              |		КОНЕЦ) КАК Сумма02Кон
	              |ПОМЕСТИТЬ ТЧ_Кон
	              |ИЗ
	              |	РегистрБухгалтерии.Международный.Остатки(
	              |			&КонПЕриода,
	              |			Счет В (&МассивСчетов),
	              |			&ОсновныеСредства,
	              |			Организация = &Организация
	              |				И Субконто1 В (&МассивОС)) КАК МеждународныйОстатки
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	МеждународныйОстатки.Субконто1
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	МеждународныйОстатки.Субконто1,
	              |	ВЫБОР
	              |		КОГДА МеждународныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Международный.ОСвОрганизации)
	              |			ТОГДА МеждународныйОстатки.СуммаОстаток
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК Сумма01Нач,
	              |	ВЫБОР
	              |		КОГДА МеждународныйОстатки.Счет = ЗНАЧЕНИЕ(ПланСчетов.Международный.АмортизацияОС_01)
	              |			ТОГДА -МеждународныйОстатки.СуммаОстаток
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК Сумма02Нач
	              |ПОМЕСТИТЬ ВТ_Нач
	              |ИЗ
	              |	РегистрБухгалтерии.Международный.Остатки(
	              |			&НачПериода,
	              |			Счет В (&МассивСчетов),
	              |			&ОсновныеСредства,
	              |			Организация = &Организация
	              |				И Субконто1 В (&МассивОС)) КАК МеждународныйОстатки
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВЫБОР
	              |		КОГДА ВТ_Нач.Субконто1 ЕСТЬ NULL 
	              |			ТОГДА ТЧ_Кон.ОС
	              |		ИНАЧЕ ВТ_Нач.Субконто1
	              |	КОНЕЦ КАК ОС,
	              |	МАКСИМУМ(ЕСТЬNULL(ВТ_Нач.Сумма01Нач, 0)) КАК Сумма01Нач,
	              |	МАКСИМУМ(ЕСТЬNULL(ТЧ_Кон.Сумма01Кон, 0)) КАК Сумма01Кон,
	              |	МАКСИМУМ(ЕСТЬNULL(ВТ_Нач.Сумма02Нач, 0)) КАК Сумма02Нач,
	              |	МАКСИМУМ(ЕСТЬNULL(ТЧ_Кон.Сумма02Кон, 0)) КАК Сумма02Кон
	              |ИЗ
	              |	ВТ_Нач КАК ВТ_Нач
	              |		ПОЛНОЕ СОЕДИНЕНИЕ ТЧ_Кон КАК ТЧ_Кон
	              |		ПО ВТ_Нач.Субконто1 = ТЧ_Кон.ОС
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВЫБОР
	              |		КОГДА ВТ_Нач.Субконто1 ЕСТЬ NULL 
	              |			ТОГДА ТЧ_Кон.ОС
	              |		ИНАЧЕ ВТ_Нач.Субконто1
	              |	КОНЕЦ";
	Запрос.УстановитьПараметр("ОсновныеСредства",ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
	Запрос.УстановитьПараметр("КонПериода",КонецДня(ЭтотОбъект.ПериодКонец));
	Запрос.УстановитьПараметр("НачПериода",ЭтотОбъект.ПериодНачало);
	Запрос.УстановитьПараметр("МассивСчетов",МассивДт);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("МассивОС",ОсновныеСредства.Выгрузить().ВыгрузитьКолонку("ОсновноеСредство"));
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	//\\АБС ИЗМЕНЕНИЕ 71572 КОНЕЦ
КонецФункции

//АБС

//АБС ВСТАВКА 36048  11.03.2014 16:18:47  Глебов
Процедура ЗаполнитьОС() Экспорт

	ОсновныеСредства.Очистить();
	Счета = ПланыСчетов.Хозрасчетный;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МеждународныйОстатки.Субконто1,
	               |	МеждународныйОстатки.СуммаОстатокДт
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрБухгалтерии.Международный.Остатки(&КонецПериода, Счет = ЗНАЧЕНИЕ(ПланСчетов.Международный.ОсВОрганизации), , ) КАК МеждународныйОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.Субконто1 КАК ОС,
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	               |	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК СуммаОборотКт,
	               |	ХозрасчетныйОбороты.Регистратор КАК Документ
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&Счет), &ОС, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	               |		ПО ХозрасчетныйОбороты.Субконто1 = ВТ_Остатки.Субконто1
	               |ГДЕ
	               |	(ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.абс_ЧастичнаяЛиквидацияОС
	               |			ИЛИ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.ПередачаОС
	               |			ИЛИ ХозрасчетныйОбороты.Регистратор ССЫЛКА Документ.СписаниеОС)
	               |	И (НЕ ВТ_Остатки.Субконто1 ЕСТЬ NULL )
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ХозрасчетныйОбороты.Субконто1,
	               |	ХозрасчетныйОбороты.Регистратор";
	
	Запрос.УстановитьПараметр("НачалоПериода", ПериодНачало);
	Запрос.УстановитьПараметр("КонецПериода", ПериодКонец);
	//АБС
	//Запрос.УстановитьПараметр("Счет", Счета.ОсновныеСредстваДляПродажи);
	Запрос.УстановитьПараметр("Счет", Счета.ОсновныеСредства);
	//АБС
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОС", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТП = ОсновныеСредства.Добавить();
		СтрокаТП.ОсновноеСредство = Выборка.ОС;
		//АБС
		СтрокаТП.Документ = Выборка.Документ;
		//АБС
		СрезСведенийМежд = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.ПолучитьПоследнее(Дата, Новый Структура("ОсновноеСредство", СтрокаТП.ОсновноеСредство));

		СтрокаТП.МестонахождениеОбъекта = СрезСведенийМежд.МестонахождениеОбъекта;
		СтрокаТП.МОЛ = СрезСведенийМежд.МОЛ;
		СтрокаТП.МестонахождениеОбъектаНов = СрезСведенийМежд.МестонахождениеОбъекта;
		СтрокаТП.МОЛНов = СрезСведенийМежд.МОЛ;
	КонецЦикла;	

КонецПроцедуры
 
Процедура ЗаполнитьСтоимостьОСМеждународный()
	Движения.абс_СтоимостьОСМеждународный.Очистить();
	Для каждого Движение Из Движения.Международный Цикл		
		Если Движение.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Международный.ОсновныеСредства) И Не Движение.СчетДт = ПланыСчетов.Международный.ВыбытиеОС Тогда
			НовоеДвижение = Движения.абс_СтоимостьОСМеждународный.Добавить();
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			НовоеДвижение.Организация = Движение.Организация;
			НовоеДвижение.ОсновноеСредство = Движение.СубконтоДт.Получить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
			НовоеДвижение.Стоимость = Движение.Сумма;
			НовоеДвижение.Период = Движение.Период;
		КонецЕсли;
		Если Движение.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Международный.ОсновныеСредства) И Не Движение.СчетКт = ПланыСчетов.Международный.ВыбытиеОС Тогда
			НовоеДвижение = Движения.абс_СтоимостьОСМеждународный.Добавить();
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
			НовоеДвижение.Организация = Движение.Организация;
			НовоеДвижение.ОсновноеСредство = Движение.СубконтоКт.Получить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
			НовоеДвижение.Стоимость = Движение.Сумма;
			НовоеДвижение.Период = Движение.Период;
		КонецЕсли;
		Если Движение.СчетДт.ПринадлежитЭлементу(ПланыСчетов.Международный.АмортизацияОсновныхСредств) Тогда
			НовоеДвижение = Движения.абс_СтоимостьОСМеждународный.Добавить();
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
			НовоеДвижение.Организация = Движение.Организация;
			НовоеДвижение.ОсновноеСредство = Движение.СубконтоДт.Получить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
			НовоеДвижение.Амортизация = Движение.Сумма;
			НовоеДвижение.Период = Движение.Период;
		КонецЕсли;
		Если Движение.СчетКт.ПринадлежитЭлементу(ПланыСчетов.Международный.АмортизацияОсновныхСредств) Тогда
			НовоеДвижение = Движения.абс_СтоимостьОСМеждународный.Добавить();
			НовоеДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			НовоеДвижение.Организация = Движение.Организация;
			НовоеДвижение.ОсновноеСредство = Движение.СубконтоКт.Получить(ПланыВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства);
			НовоеДвижение.Амортизация = Движение.Сумма;
			НовоеДвижение.Период = Движение.Период;
		КонецЕсли;
	КонецЦикла;	
	Движения.абс_СтоимостьОСМеждународный.Записать();
КонецПроцедуры

//АБС ВСТАВКА 36048 КОНЕЦ 


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
